#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>



//                                          整数在内存中的储存
//⼤端（存储）模式：
//是
//指数据的低位字节内容保存在内存的⾼地址处，⽽数据的⾼位字节内容，保存在内存的低地址处。
//⼩端（存储）模式：
//是
//指数据的低位字节内容保存在内存的低地址处，⽽数据的⾼位字节内容，保存在内存的⾼地址处。

//int main()
//{
//	int a = 0x11223344;
//
//	return 0;
//}


//练习一
// 
//请简述大端字节和小端字节的概念，设计一个小程序来判断当前机器的字节序

//int check_sys()
//{
//	int a = 1;
//	if (*(char*)&a == 1)
//	{
//		return 1;  //小端
//	}
//	else
//	{
//		return 0;   //大端
//	}
//}
//
//int main()
//{
//	if (check_sys()==1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//练习二

//char  到底是有signed char 还是  unsigned char 不确定，取决于编译器
//在vs 中是signed char

#include <stdio.h>
//int main()
//{
//	char a = -1;
//	signed char b = -1;     //-1  是默认为整形 占4个字节    但是b是char类型 只占一个字节的宽度      有符号用补码储存
//	//原码  10000000 00000000 00000000 00000001
//	//反码  11111111 11111111 11111111 11111110
//	//补码  11111111 11111111 11111111 11111111     反码+1
//	//11111111   -  b     属于补码
//	unsigned char c = -1;    //无符号 范围是0~255
//	printf("a = %d, b = %d, c = %d", a, b, c);   //-1   -1   255       %d 只打印补码
// 	//%d 是以 10进制的形式打印一个有符号整数
//	//11111111   -  b
//	//高位提升  11111111 11111111 11111111 11111111          //b 是有符号类型    按有符号数高位补符号位    补完之后还是属于补码
//	//反码      11111111 11111111 11111111 11111110          //符号位不变      反码=补码-1
//	//原码      10000000 00000000 00000000 00000001          // -1
//
//	//同理
//	//11111111   -  c
//	//高位提升  00000000 00000000 00000000 11111111          //c 是无符号类型    高位提升：不管正负、不管原值，高位统一补 0
//	// 255
//	return 0;
//}




//练习三

//int main()
//{
//	char a = -128;
//	//原码   10000000 00000000 00000000 10000000
//	//反码   11111111 11111111 11111111 01111111
//	//补码   11111111 11111111 11111111 10000000
//	//10000000   -  a
//	printf("%u\n", a);   //4,294,967,168
//	//%u  是以10进制的形式，打印无符号整数      无符号补码和原码和反码是一样的
//	//高位提升  11111111 11111111 11111111 10000000
//	return 0;
//}



//int main()
//{
//	//有符号char  的范围是：-128~127
//	char a = 128;                                  //128是正数  原码  反码  补码全都一样
//	//原码   00000000 00000000 00000000 10000000
//	//反码   00000000 00000000 00000000 10000000
//	//补码   00000000 00000000 00000000 10000000
//	printf("%u\n", a);
//	//高位提升   11111111 11111111 11111111 10000000
//	return 0;
//}




//练习四
 
//int main()
//{
//	char a[1000];    //char  类型范围是  -128~127  轮回
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));   //255
//	return 0;
//}



//练习五

//unsigned char i = 0;  //无符号范围是  0~255     
//int main()
//{
//	//永远不可能大于255   会陷入死循环
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}

#include<windows.h>

//int main()
//{
//	unsigned int i;     //i  不可能小于0   也是陷入死循环
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);  //控制速率    1000就相当于 1 秒
//	}
//	return 0;
//}


//练习六

//int main()
//{
//	//x86环境  小端字节序
//	int a[4] = { 1, 2, 3, 4 };
//	int* ptr1 = (int*)(&a + 1);
//	int* ptr2 = (int*)((int)a + 1);
//	printf("%x, %x", ptr1[-1], *ptr2);
//	//%x   16进制形式打印
//	return 0;
//}






//                                       浮点数在内存中的储存

//
//int main()
//{
//	int n = 9;
//	//补码  00000000 00000000 00000000 00001001
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	*pFloat = 9.0;
//	printf("n的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	return 0;
//}


//有的浮点数不能精确保存


#include<math.h>

#define EXP 0.0000001

//abs   整数绝对值
//fabs   浮点数绝对值

//int main()
//{
//	if (fabs((0.1 + 0.2) - 0.3)<EXP)        //EXP表示误差  
//	{
//		printf("相等\n");
//	}
//	else
//	{
//		printf("不相等\n");
//	}
//
//	return 0;
//}




//int main()
//{
//    int num = 10;
//    int n = num << 1;
//    printf("n = %d\n", n);
//    printf("num = %d\n", num);
//    return 0;
//}



//int main()
//{
//    int num1 = -3;
//    int num2 = 5;
//    printf("%d\n", num1 & num2);
//    printf("%d\n", num1 | num2);
//    printf("%d\n", num1 ^ num2);
//    printf("%d\n", ~0);
//    return 0;
//}