#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//静态内存


//int val = 20; //在栈空间上开辟4个字节
//char arr[10] = { 0 };   //在栈空间上开辟10个连续空间


//    1. 为什么要动态内存分配
// 静态内存 的空间开辟是固定的，在使用是不能调整
// 引入动态内存开辟，可以自己 申请 和 释放 空间，就比较灵活了


//           一， 动态内存开辟函数
//malloc 负责申请内存  free  负责释放内存

// malloc函数
#include<stdlib.h>
//void* malloc(size_t size);        //size；要分配的内存的我字节数
//功能：向内存的堆区申请⼀块连续可⽤的空间，并返回指向这块空间的起始地址

//如果开辟成功，则返回这块空间的起始地址。
//如果开辟失败，则返回⼀个返回值的类型是NULL指针，因此malloc的返回值⼀定要做检查。
//返回值是void*，所以malloc函数并不知道开辟空间的类型，具体在使⽤的时候使⽤者

//int main()
//{
//	//int arr[] = { 1,2,3,4,5 }; //申请20个字节的空间 - 栈区
//	int* p = (int*)malloc(20); // 在堆区上申请20个字节的空间 - 堆区
//	//判断是非申请成功
//	if (p == NULL)
//	{
//		perror("use malloc");   //先打印括号里面的内容再打印错误信息
//		return 1;
//	}
//	//使用空间
//	for (int i = 0; i < 5; i++)
//	{
//		p[i] = i + 1;
//	}
// //释放内存
//	free(p);
//	p=NULL;
//
//	return 0;
//}



// free函数
//void free(void* ptr);

//功能：专⻔是⽤来做动态内存的释放和回收的
// 
//ptr:指向要释放的内存块的指针
//如果参数ptr指向的空间不是动态开辟的，那free函数的⾏为是未定义的。
//如果参数ptr是NULL指针，则函数什么事都不做



//   calloc 函数
//void* calloc(size_t num, size_t size);

//功能：函数的功能是为num个⼤⼩为size的元素开辟⼀块空间，并且把空间的每个字节初始化为0。
//与函数malloc的区别只在于calloc会在返回地址之前把申请的空间的每个字节初始化为0
