#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


//⼤端（存储）模式：
//是
//指数据的低位字节内容保存在内存的⾼地址处，⽽数据的⾼位字节内容，保存在内存的低地址处。
//⼩端（存储）模式：
//是
//指数据的低位字节内容保存在内存的低地址处，⽽数据的⾼位字节内容，保存在内存的⾼地址处。

//int main()
//{
//	int a = 0x11223344;
//
//	return 0;
//}


//练习一
// 
//请简述大端字节和小端字节的概念，设计一个小程序来判断当前机器的字节序

//int check_sys()
//{
//	int a = 1;
//	if (*(char*)&a == 1)
//	{
//		return 1;  //小端
//	}
//	else
//	{
//		return 0;   //大端
//	}
//}
//
//int main()
//{
//	if (check_sys()==1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//练习二

//char  到底是有signed char 还是  unsigned char 不确定，取决于编译器
//在vs 中是signed char

#include <stdio.h>
//int main()
//{
//	char a = -1;
//	signed char b = -1;     //-1  是默认为整形 占4个字节    但是b是char类型 只占一个字节的宽度      有符号用补码储存
//	//原码  10000000 00000000 00000000 00000001
//	//反码  11111111 11111111 11111111 11111110
//	//补码  11111111 11111111 11111111 11111111     反码+1
//	//11111111   -  b     属于补码
//	unsigned char c = -1;    //无符号 范围是0~255
//	printf("a = %d, b = %d, c = %d", a, b, c);   //-1   -1   255       %d 只打印补码
// 	//%d 是以 10进制的形式打印一个有符号整数
//	//11111111   -  b
//	//高位提升  11111111 11111111 11111111 11111111          //b 是有符号类型    按有符号数高位补符号位    补完之后还是属于补码
//	//反码      11111111 11111111 11111111 11111110          //符号位不变      反码=补码-1
//	//原码      10000000 00000000 00000000 00000001          // -1
//
//	//同理
//	//11111111   -  c
//	//高位提升  00000000 00000000 00000000 11111111          //c 是无符号类型    高位提升：不管正负、不管原值，高位统一补 0
//	// 255
//	return 0;
//}




//练习三

//int main()
//{
//	char a = -128;
//	//原码   10000000 00000000 00000000 10000000
//	//反码   11111111 11111111 11111111 01111111
//	//补码   11111111 11111111 11111111 10000000
//	//10000000   -  a
//	printf("%u\n", a);   //4,294,967,168
//	//%u  是以10进制的形式，打印无符号整数      无符号补码和原码和反码是一样的
//	//高位提升  11111111 11111111 11111111 10000000
//	return 0;
//}



int main()
{
	//有符号char  的范围是：-128~127
	char a = 128;                                  //128是正数  原码  反码  补码全都一样
	//原码   00000000 00000000 00000000 10000000
	//反码   00000000 00000000 00000000 10000000
	//补码   00000000 00000000 00000000 10000000
	printf("%u\n", a);
	//高位提升   11111111 11111111 11111111 10000000
	return 0;
}