#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//                           文件操作

//1. 为什么要使用文件

//如果没有⽂件，我们写的程序的数据是存储在电脑的内存中，如果程序退出，内存回收，数据就丢失
//了，等再次运⾏程序，是看不到上次程序的数据的，如果要将数据进⾏持久化的保存，我们可以使⽤
//⽂件
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	int n = 0;
//	scanf("%d", &n);
//	if (n = 1)              //当输入1 正常运行之后数组内存的数据在第二次输入0是不会输出      ，输入数组的数据没有保存 return 0 后内存回收
//	{
//		for (i = 0; i < 10; i++)
//		{
//			scanf("%d", arr + i);
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d", arr[i]);
//	}
//	return 0;
//}


//2.文件名

//⼀个⽂件要有⼀个唯⼀的⽂件标识，以便⽤⼾识别和引⽤。
//⽂件名包含3部分：⽂件路径 + ⽂件名主⼲ + ⽂件后缀

//2.1 绝对路径和相对路径
//绝对路径： 带根目录的 D : \project\clearn\c语言笔记\c_learn\c_learn
//绝对路径：.表示当前目录   ..表示上一级目录
//..\..\c语言笔记  表示向上两级进入c语言笔记文件夹中

//3. 程序文件

//程序⽂件包括源程序⽂件（后缀为.c）, ⽬标⽂件（windows环境后缀为.obj）, 可执⾏程序（windows
//环境后缀为.exe）。

