#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//                      代码的实现存在两种环境
//第1种是翻译环境，在这个环境中源代码被转换为可执⾏的机器指令（⼆进制指令）。
//第2种是执⾏环境，它⽤于实际执⾏代码


//一，翻译环境
//翻译环境是由编译和链接两个⼤的过程组成的，⽽编译⼜可以分解成：预处理（有些书也叫预编
//译）、编译、汇编三个过程


//.c文件的执行程序
//多个.c⽂件单独经过编译器，编译处理⽣成对应的⽬标⽂件
//注：在Windows环境下的⽬标⽂件的后缀是.obj,Linux环境下⽬标⽂件的后缀是.o
//多个⽬标⽂件和链接库⼀起经过链接器处理⽣成最终的可执⾏程序。
//链接库是指运⾏时库(它是⽀持程序运⾏的基本函数集合)或者第三⽅库。


//预处理(预编译)    生成.i文件
//在预处理阶段，源⽂件和头⽂件会被处理成为.i为后缀的文件
//预处理阶段主要处理那些源⽂件中#开始的预编译指令 如#include  #define

//处理规则：
//1.将所有的#define删除，并展开所有的宏定义
//2.处理所有的条件编译指令

//3.处理#include预编译指令，将包含的头⽂件的内容插⼊到该预编译指令的位置(生成.i文件时写在前面)。这个过程是递归进
//⾏的，也就是说被包含的头⽂件也可能包含其他⽂件

//4.删除所有注释（并用空格代替）
//5.添加⾏号和⽂件名标识，⽅便后续编译器⽣成调试信息等
//6.保留所有的#pragma 的编译器指令，编译器后续会使⽤


//编译    (生成.s文件)
//预处理后，进行编译,编译分为词法分析，语法分析，语义分析及优化

//词法分析
//被扫描器扫描 把代码中的字符分割成⼀系列的记号（关键字、标识符、字⾯量、特殊字符等)

//语法分析
//生成一个语法树,语法树以表达式为节点

//语义分析
//由语义分析器完成（静态分析），静态语义分析通常包括声明和类型的匹配，类型的转换等。这个阶段会报告错误的语法信息


//汇编
//汇编器是将汇编代码转变成机器可执⾏的指令（2进制的指令），每⼀个汇编语句⼏乎都对应⼀条机器指令。
// 就是根据汇编指令和机器指令的对照表⼀⼀的进⾏翻译，也不做指令优化



//链接
//每个.c文件都是单独经过编译器的，当我们文件引用声明时则需要通过链接来完成
//链接的时候需要把⼀堆⽂件链接在⼀起才⽣成可执⾏程序
//链接过程主要包括：地址和空间分配，符号决议和重定位等这些步骤。




//二，运行环境
//1.程序必须载⼊内存中。在有操作系统的环境中：⼀般这个由操作系统完成。在独⽴的环境中，程序
//的载⼊必须由⼿⼯安排，也可能是通过可执⾏代码置⼊只读内存来完成

//2.程序的执行便开始，接着调用main函数

//开始执⾏程序代码。这个时候程序将使⽤⼀个运⾏时堆栈（stack），存储函数的局部变量和返回
//地址。程序同时也可以使⽤静态（static）内存，存储于静态内存中的变量在程序的整个执⾏过程
//⼀直保留他们的值

//4. 终⽌程序。正常终⽌main函数；也有可能是意外终⽌。