#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//代码的实现存在两种环境
//第1种是翻译环境，在这个环境中源代码被转换为可执⾏的机器指令（⼆进制指令）。
//第2种是执⾏环境，它⽤于实际执⾏代码


//翻译环境
//翻译环境是由编译和链接两个⼤的过程组成的，⽽编译⼜可以分解成：预处理（有些书也叫预编
//译）、编译、汇编三个过程


//.c文件的执行程序
//多个.c⽂件单独经过编译器，编译处理⽣成对应的⽬标⽂件
//注：在Windows环境下的⽬标⽂件的后缀是.obj,Linux环境下⽬标⽂件的后缀是.o
//多个⽬标⽂件和链接库⼀起经过链接器处理⽣成最终的可执⾏程序。
//链接库是指运⾏时库(它是⽀持程序运⾏的基本函数集合)或者第三⽅库。


//预处理(预编译)    生成.i文件
//在预处理阶段，源⽂件和头⽂件会被处理成为.i为后缀的文件
//预处理阶段主要处理那些源⽂件中#开始的预编译指令 如#include  #define

//处理规则：
//1.将所有的#define删除，并展开所有的宏定义
//2.处理所有的条件编译指令

//3.处理#include预编译指令，将包含的头⽂件的内容插⼊到该预编译指令的位置(生成.i文件时写在前面)。这个过程是递归进
//⾏的，也就是说被包含的头⽂件也可能包含其他⽂件

//4.删除所有注释（并用空格代替）
//5.添加⾏号和⽂件名标识，⽅便后续编译器⽣成调试信息等
//6.保留所有的#pragma 的编译器指令，编译器后续会使⽤


//编译    (生成.s文件)
//预处理后，进行编译,编译分为词法分析，语法分析，语义分析及优化

//词法分析
//被扫描器扫描 把代码中的字符分割成⼀系列的记号（关键字、标识符、字⾯量、特殊字符等)

//语法分析
//生成一个语法树,语法树以表达式为节点

//语义分析
//由语义分析器完成（静态分析），静态语义分析通常包括声明和类型的匹配，类型的转换等。这个阶段会报告错误的语法信息